[
 {
    "blogId": "nginx-logging",
    "title": "Implement logging service with nginx",
    "createTime": "2016-08-25",
    "tags": ["nginx", "logging"],
    "abstract": "In data processing, there are a lot of cases that need collect logs. This requires a log collection server with high concurrency and good performance. The API of the server could be very simple. But the requirement of the performance of the logging api is very high, because it is possible that there would be thousands or even millions of requests per second."
  }, {
  	"blogId": "stream-bench",
  	"title": "StreamBench: Stream Processing Systems Benchmark",
  	"createTime": "2016-08-23",
  	"tags": ["big data", "stream processing", "benchmark", "flink"],
  	"abstract": "Big Data has three dimensions volumn, velocity and variety. MapReduce and Spark solve volumn very well. The speed of data generation and the requirement of stream data processing increase dramatically. Currently there are several streaming processing systems trying to solve the velocity of Big Data and are widely adopted, such as Storm, Spark Streaming, IBM InfoSphere Streams, and Flink."
  }, {
    "blogId": "react-unit-test",
    "title": "Unit test for React.js App",
    "createTime": "2016-08-27",
    "tags": ["react", "unit test"],
    "abstract": "A React App is consisted of components. A React component might contains multi sub-components. A well designed component should be reusable and stable. To achieve this, unit test is a necessity. In this article, I will introduce the method of unit test we used in our production development."
  }, {
    "blogId": "docker-gui",
    "title": "Setup GUI for Docker Container on Mac",
    "createTime": "2017-03-01",
    "tags": ["Docker", "Mac os"],
    "abstract": "This page will introduce how to setup GUI for a docker container running on Mac OS with ``-e DISPLAY`` flag."
  }, {
    "blogId": "firefox",
    "title": "Firefox with Kiosk Mode",
    "createTime": "2016-10-19",
    "tags": ["firefox", "add-ons"],
    "abstract": "In some case, application is running in a brower with kiosk mode. In this article, we will introduce how to install Firefox with add-ons(R-kiosk and firebug with consoleexport) automaticlly without any manually action."
  }, {
    "blogId": "after-master-graduate",
    "title": "Title：从硕士毕业到家庭主妇",
    "createTime": "2016-10-23",
    "tags": ["芬兰", "硕士"],
    "abstract": "有相当多的人因为跟芬兰人生了孩子，这辈子无法离开芬兰，最后只能做个实际上的家庭主妇，偶尔被Kela要求就去做做职业培训，并没有职业路线。做家庭主妇没有什么不好的，关键是孩子好就行，这是共识。"
  }
]
